Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v6.42.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

[0m[1mgoogle_compute_firewall.allowing-https: Refreshing state... [id=projects/tonal-benefit-462606-b8/global/firewalls/allowing-https][0m
[0m[1mgoogle_compute_firewall.allowing-http: Refreshing state... [id=projects/tonal-benefit-462606-b8/global/firewalls/allowing-http][0m
[0m[1mgoogle_compute_instance.rocky_vms: Refreshing state... [id=projects/tonal-benefit-462606-b8/zones/asia-southeast1-a/instances/rocky-vm2][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # google_compute_firewall.allowing-https[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "google_compute_firewall" "allowing-https" {
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m = "2025-07-04T02:44:53.556-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdestination_ranges[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdirection[0m[0m          = "INGRESS" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisabled[0m[0m           = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                 = "projects/tonal-benefit-462606-b8/global/firewalls/allowing-https" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m               = "allowing-https" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mnetwork[0m[0m            = "https://www.googleapis.com/compute/v1/projects/tonal-benefit-462606-b8/global/networks/default" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mpriority[0m[0m           = 1000 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m            = "tonal-benefit-462606-b8" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m          = "https://www.googleapis.com/compute/v1/projects/tonal-benefit-462606-b8/global/firewalls/allowing-https" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msource_ranges[0m[0m      = [
          [31m-[0m [0m"0.0.0.0/0",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [31m-[0m [0m"https-server",
        ] [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mallow {
          [31m-[0m [0m[1m[0mports[0m[0m    = [
              [31m-[0m [0m"443",
            ] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mprotocol[0m[0m = "tcp" [90m->[0m [0m[90mnull[0m[0m
        }
    }
[1m  # google_compute_instance.rocky_vms[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_instance" "rocky_vms" {
      [33m~[0m [0m[1m[0mcurrent_status[0m[0m       = "RUNNING" [33m->[0m [0m"STOPPING"
        [1m[0mid[0m[0m                   = "projects/tonal-benefit-462606-b8/zones/asia-southeast1-a/instances/rocky-vm2"
      [32m+[0m [0m[1m[0mlabels[0m[0m               = {}
        [1m[0mname[0m[0m                 = "rocky-vm2"
      [32m+[0m [0m[1m[0mresource_policies[0m[0m    = []
        [1m[0mtags[0m[0m                 = [
            "http-server",
            "https-server",
            "rocky",
        ]
        [90m# (16 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mboot_disk {
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m [0minitialize_params {
              [32m+[0m [0m[1m[0mresource_manager_tags[0m[0m       = {}
                [90m# (9 unchanged attributes hidden)[0m[0m
            }
        }



        [90m# (3 unchanged blocks hidden)[0m[0m
    }
[1m  # google_compute_firewall.allowing-http[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "google_compute_firewall" "allowing-http" {
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m = "2025-07-04T02:44:53.557-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdestination_ranges[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdirection[0m[0m          = "INGRESS" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisabled[0m[0m           = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                 = "projects/tonal-benefit-462606-b8/global/firewalls/allowing-http" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m               = "allowing-http" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mnetwork[0m[0m            = "https://www.googleapis.com/compute/v1/projects/tonal-benefit-462606-b8/global/networks/default" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mpriority[0m[0m           = 1000 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m            = "tonal-benefit-462606-b8" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m          = "https://www.googleapis.com/compute/v1/projects/tonal-benefit-462606-b8/global/firewalls/allowing-http" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msource_ranges[0m[0m      = [
          [31m-[0m [0m"0.0.0.0/0",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [31m-[0m [0m"http-server",
        ] [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mallow {
          [31m-[0m [0m[1m[0mports[0m[0m    = [
              [31m-[0m [0m"80",
            ] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mprotocol[0m[0m = "tcp" [90m->[0m [0m[90mnull[0m[0m
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_compute_firewall.allowing-http[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allowing-http" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = "INGRESS"
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "allowing-http"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = "default"
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "tonal-benefit-462606-b8"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"0.0.0.0/0",
        ]
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [32m+[0m [0m"http-server",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"80",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # google_compute_firewall.allowing-https[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allowing-https" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = "INGRESS"
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "allowing-https"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = "default"
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "tonal-benefit-462606-b8"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"0.0.0.0/0",
        ]
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [32m+[0m [0m"https-server",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"443",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://4e403e64400b:4141/lock?id=GeetaSree13%252Fterraform_ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
